#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");   

    // 1) календарь
    cout << "    |----------------------------------|   \n";
    cout << "    | апрель, 2022г.                   |   \n";
    cout << "    |----------------------------------|   \n";
    cout << "    | пн   вт   ср   чт   пт   сб   вс |   \n";
    cout << "    |                     1    2    3  |   \n";
    cout << "    | 4    5    6    7    8    9    10 |   \n";
    cout << "    | 11   12   13   14   15   16   17 |   \n";
    cout << "    | 18   19   20   21   22   23   24 |   \n";
    cout << "    | 25   26   27   28   29   30      |   \n";
    cout << "    | 25   26   27   28   29   30      |   \n";
    cout << "    |----------------------------------|   \n";

    // 2) генеалогичексое дерево
    cout << "                                   Толмачев Богдан Евгеньевич (я)                               \n";
    cout << "                                                *                                               \n";
    cout << "                                                *                                               \n";
    cout << "                                               * *                                              \n";
    cout << "                                              *   *                                             \n";
    cout << "                  Толмачев Евгений Владимирович   Юрьева Татьяна Викторовна                     \n";
    cout << "                                *                                *                              \n";
    cout << "                                *                                *                              \n";
    cout << "                               * *                              * *                             \n";
    cout << "                              *   *                            *   *                            \n";
    cout << " Толмачев Владимир Владимирович   Трущ Галина Николаевна      *     *                           \n";
    cout << "                                                             *       *                          \n";
    cout << "                                        Юрьев Виктор Тарасович       Ботнарь Любовь Пантелеевна \n";

    // 3) мое имя
    cout << "    *********      *******         ******             ******    \n";
    cout << "   ***            **     **       **    **           **    **   \n";
    cout << "   ***            **     **       **    **           **    **   \n";
    cout << "   ***            **     **       **    **           **    **   \n";
    cout << "   *********      **     **       **    **           **    **   \n";
    cout << "   ***    ***     **     **       **    **            *******   \n";
    cout << "   ***    ***     **     **     ************        **     **   \n";
    cout << "   ***    ***     **     **    **          **      **      **   \n";
    cout << "    ********       *******     **          **    **        **   \n";
}